{"comments_archived":true,"date":"2005-02-19T00:00:00.000Z","excerpt":"Anyway, I'm still out here, still alive.  Just working my ass off\nand neglecting just about everything else in my life.  But, the smoke's\nstarting to clear, so hopefully friends and family (and you, dear reader)\nwill begin to hear more from me soon.","layout":"post","title":"Writing No Things of Epic Import","wordpress_id":588,"wordpress_slug":"writing-no-things-of-epic-import","wordpress_url":"http://www.decafbad.com/blog/?p=588","url":"/2005/02/19/writing-no-things-of-epic-import/","path":"2005/02/19/writing-no-things-of-epic-import","content":"<p><blockquote>I keep seeing flashes of text, sentence-bursts that I have the impulse to blog and then, inevitably, evaporate in a &quot;nah, too short.&quot; I have no doubt that in my case not just the tool (movabletype) but also my weblog&#39;s design have influenced me to go for longer, article-like posts rather than the shorter posts we see elsewhere.\n</blockquote></p>\n<div align=\"right\"><small>Source: <cite><a href=\"http://www.dynamicobjects.com/d2r/archives/003112.html\">d2r - a tool&#39;s influence</a></cite></small></div>\nIt suddenly occurred to me that I haven&#39;t <em>actually</em> written more here [as I thought I would][write], since starting the book.  Well, I suppose that can be excused since almost immediately after making that prediction, I launched into working on a side job that has kept me pretty busy, along with the main day job, and catching up on the book (up to about 1/3 written now!)\n\n[write]: <a href=\"http://www.decafbad.com/blog/2005/01/07/belated_happy_new_year\">http://www.decafbad.com/blog/2005/01/07/belated_happy_new_year</a>\n\nHowever, it also occurred to me that I&#39;ve been holding back on writing anything that runs under 100 words here.  <em>That&#39;s not an essay!  Why go through the trouble of posting that?</em>, I&#39;ve been thinking.  I&#39;m in the same boat with Diego, whom I&#39;ve quoted above, because not only does my Movable Type installation seem pretty much like a freighter when I want to post something, but I&#39;ve built all the templates to be mostly biased toward Entries of Epic Import--which is, well, a little presumptuous and gives me a lot of incentive to just not come back here much.<br>\nSo, a few things:\n\n<em> I think I&#39;m going to try more quick sentence-blogging, but maybe just as a daily dump of quickies in a single post for now.  I&#39;ll just keep an [ecto][ecto] window open through the day and mumble into it periodically.\n</em> I&#39;m still planning my annual refresh of this place, so I think when I get time to do that, I&#39;ll make better considerations for short posts, ala <a href=\"http://www.kottke.org/\">Kottke</a> or <a href=\"http://photomatt.net/2004/05/19/asides/\">Photo Matt</a>.\n* Also, having just worked with writing Jabber and AIM chatbots for my book, I&#39;m thinking it might be a nifty idea to post via IM.  [Think tiny tuples][tuples].\n\nAnyway, I&#39;m still out here, still alive.  Just working my ass off and neglecting just about everything else in my life.  But, the smoke&#39;s starting to clear, so hopefully friends and family (and you, dear reader) will begin to hear more from me soon.\n\n[ecto]: <a href=\"http://ecto.kung-foo.tv/\">http://ecto.kung-foo.tv/</a>\n[tuples]: <a href=\"http://www.decafbad.com/blog/2005/01/12/the_blogosphere_as_a_tuple_space\">http://www.decafbad.com/blog/2005/01/12/the_blogosphere_as_a_tuple_space</a>\n\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221084628\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://www.thok.org/bloggery\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=2545d4ff0ba72eb5d5979186f4b02d85&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://www.thok.org/bloggery\">Mark Eichin</a>\n                </div>\n                <a href=\"#comment-221084628\" class=\"permalink\"><time datetime=\"2005-02-20T14:49:45\">2005-02-20T14:49:45</time></a>\n            </div>\n            <div class=\"content\">A friend and I recently had a discussion of the amount of effort it took to actually push things out into a blog, and how he&#39;d gotten it down to a few keystrokes and yet there was still an energy barrier. After a brief digression into Raskin-style &quot;no keystroke&quot; interfaces, we realized that there was a lot of stuff that we just send to our friends on zephyr (instant messaging with group channels and very low overhead) that people without such a channel would blog instead - and that perhaps having a chat to blog converter would be useful. I&#39;ve certainly seen IRC &quot;bots&quot; that produce link-blogs from everything that goes by on the channel, this would be more conversation-oriented... anyway, it all &quot;chimed&quot; with your &quot;sentence-blogging&quot; comments and posting-by-im.</div>\n\n<pre><code>    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221084629&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://kennethhunt.com&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=9b8ea315cc1b2de28e883e091e943dd2&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://kennethhunt.com&quot;&gt;Kenneth&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221084629&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-02-22T08:21:41&quot;&gt;2005-02-22T08:21:41&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;Your silence has been noted. It&#39;s nice to see you surfacing again.\n</code></pre><p>Short is sweet. I&#39;m reminded of Richard P. Gabriel&#39;s insistence that periodic output of poetry enhanced the creativity of the authors.</p>\n<p>Perhaps you should be dashing off haiku&#39;s!</p>\n<p>Have Fun!</div></p>\n<pre><code>    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}