{"comments_archived":true,"date":"2006-05-26T00:00:00.000Z","layout":"post","title":"Confessions of a Serial Enthusiast","wordpress_id":951,"wordpress_slug":"confessions-of-a-serial-enthusiast","wordpress_url":"http://decafbad.com/blog/2006/05/26/confessions-of-a-serial-enthusiast","url":"/2006/05/26/confessions-of-a-serial-enthusiast/","path":"2006/05/26/confessions-of-a-serial-enthusiast","content":" <p>Lately, in between wedding preparations and other goings on of late, I&#39;ve been doing some navel gazing and thinking about my enthusiasms and what&#39;s next.  And, there&#39;s one conclusion to which I&#39;ve come, which is yet half-formed but I think interesting to admit and explore.</p>\n <p>You see, the realization to which I&#39;ve come is that - in the realm of recreational programming, at least - I could be best described as a <i>serial enthusiast</i>.</p>\n <p>What&#39;s that mean?  Well, just look at my history throughout the archives of this blog.  I&#39;ve flitted from nano-project to nano-project, a hack here and a hack there.  But, other than in projects where someone&#39;s expecting something from me and (preferrably) paying me - I have a very fickle attention span.  If you hire me, or have me sign a contract, I&#39;ll stick to schedule and deliver as best I can - no worries about that.  When I&#39;m in &quot;professional mode,&quot; I run on different premises and motivations.  But, left to my own devices, I will freewheel and wander between a slew of part-time obsessions.</p>\n <p>Of course, on frequent occassion, I return to the themes and constructions I&#39;ve visited in the past.  This has the effect of a sort of sustained, incremental development of my nano-projects, well distributed across time.  I drive myself through development sprints, but never quite finish complete products.  I share the code, in whatever state I&#39;ve left it, in the hopes that someone might find it useful - but very rarely do I wrap things up with a bow.</p>\n <p>This is <a href=\"http://www.intertwingly.net/blog/2006/03/11/Recreational-Programming\"><i>recreational programming</i></a>.  I enjoy the process much more than I do the results.  This is why I have no particular worries about under what license I release my work.  Go right ahead: <b>Share and Enjoy</b> my Sudoku puzzle solutions, because I&#39;m done with them.  After all, were I ever to finish something useful, I might get sucked into it and anchored down to supporting it when my interest has faded - and that&#39;s no fun, unless there&#39;s another source of reward available for continuing the work.</p>\n <p>And this is why I think that so far - unless I find something of particular lasting interest or work on modifying my habits - I&#39;ll never be a successful entrepreneur on my own.  I&#39;ve got ideas and skills, sure - but I need a partner, or a manager, to keep me and everything else to a coherent and sustained path.  I&#39;ve got energy and I&#39;ve got creativity, but I need others as <a href=\"http://www.abc.net.au/rn/science/mind/stories/s1391503.htm\">social prosthetics</a> to herd me and my mental cats.</p>\n <p>So what&#39;s my point in all of this?  Mostly just writing to think this notion through.  I&#39;m sure this isn&#39;t a terribly original self-discovery, but it&#39;s one that I wanted to admit and elaborate so that I can at least explain myself to myself and work with it.  And, having said all that, I thought that there just might be some others freewheeling around out there with whom the phrase &quot;serial enthusiast&quot; might hold some meaning, too.</p>\n\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221082616\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://xmlhacker.com\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=5159227f15ff6247f88542812f866c4f&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://xmlhacker.com\">M. David Peterson</a>\n                </div>\n                <a href=\"#comment-221082616\" class=\"permalink\"><time datetime=\"2006-05-27T02:00:37\">2006-05-27T02:00:37</time></a>\n            </div>\n            <div class=\"content\"><p>Hey Leslie,</p>\n\n<p>Welcome!  I joined the club about 3 years ago.  If you need any help finding your way around, let me know... I&#39;ve come to know these parts quite well now, so if I can be of assistance, by all means, please let me know. :D</p>\n\n<p>BTW...  Isn&#39;t it a refreshing moment when you finally give into the notion of letting go of the idea that you have to push yourself a certain direction, or commit to being a certain way, just to feel like you are something the world would like you to be, yet nothing you want to be?</p>\n\n<p>I know it was for me, and the result, as it turns out, has been marvelous!  Over the course of the last three years I have developed friendships, and relationships with folks of which each contained a quality I didn&#39;t have, yet our personalities and overall hacking habits were for all intents and purposes, the same thing...  Not completely, but just enough of the same thing to help in understanding that youre not alone in this, yet just enough difference to garner the admiration and respect that we tend to develop for our hacking brothers and sisters who have developed a fairly specialized skill that fits nicely into filling an area in which needs filling in regards to a long term brainstorm-based project, in which the project itself has a general purpose, yet no immediatelly clear definition as to where the proper focus needs to be place.</p>\n\n<p>Recently, a group of folks I have been working with in various degress for the last 2+ years finally brought together some of the final pieces of a project we all have had interest in, and things are finally taking the final shape, of which consists of a base of clay we have all spent the last 2 years throwing into a general pile, various pieces here and there which somehow just kind of spontaneously began to take shape about 2 weeks ago.</p>\n\n<p>It seems as if this is the way it happens.  Its all about timing, and not forcing anything that doesnt need to be forced.  It just nees to be left alone until it happens.</p>\n\n<p>And it will.  I promise :)</p>\n\n<p>If ever you find you&#39;d like to hear what our little hackers anonymous chapter is up to, my contact info is collected above.  As such, you know where to find me if you find interest in hearing more about the various projects we&#39;re working on.  But its of no major significance.  Your obviously and AMAZING talent, and it seems could use that talent to have quite a bit of fun with some of the projects we are developing.  But to truly understand the mentality of a hacker, you need to be a hacker yourself.  When you are, you understand by nature that nothing can be forced... you just have to let it happen. :)</p>\n\n<p>Enjoy your day!  And again...  Welcome :)  Your in REALLY GOOD COMPANY (I&#39;m not suggesting that in regards to me directly, and instead to our overall &quot;meme genre&quot;.  Us hackers are all this way... just in slightly different areas of specialyt :)</p>\n\n<p>Hope this helps!  And congratulations on your wedding!</p></div>\n\n<pre><code>    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221082618&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://dannyayers.com&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=7028f422ca6da0180de6c9d922a3228f&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://dannyayers.com&quot;&gt;Danny&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221082618&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2006-05-27T11:29:25&quot;&gt;2006-05-27T11:29:25&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;&lt;p&gt;Thanks for posting this (from everyone with a trail of unfinished projects :-) Is there such a thing as an Angel Organiser? Ah, you just got married (congrats!), ok, moving swiftly on...&lt;/p&gt;\n</code></pre><p>I&#39;ve been lucky, over the past few years my professional and hobbiest bits have grown to overlap more and more, I guess as a result of 1. being interested in comparatively obscure stuff (I do hop around nanoprojects a lot, but generally there&#39;s some SemWebbish angle); 2. doing contract work; 3. blogging a lot - which means 2. gets tied to 1.</p>\n\n<p>Can&#39;t deny I do still have major problems with attention, not having enough time, procrastination, etc, and though I&#39;m generally not bad at hitting them, I do find deadlines very stressful. </p>\n\n<p>Have you run into the <a href=\"http://www.humanmetrics.com/cgi-win/JTypes1.htm \" rel=\"nofollow\">Myers-Briggs</a> test btw? It&#39;s one of those things that really shouldn&#39;t work, horrid profiling stuff, but does seem to be worryingly accurate. Fun anyhow.</p></div>\n\n        </li>\n\n        <li class=\"comment\" id=\"comment-221082620\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://idid.wordpress.com\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=e7dd5182b72baa77441d63c06465f784&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://idid.wordpress.com\">McD</a>\n                </div>\n                <a href=\"#comment-221082620\" class=\"permalink\"><time datetime=\"2006-06-01T17:24:36\">2006-06-01T17:24:36</time></a>\n            </div>\n            <div class=\"content\"><p>Les,</p>\n\n<p>It&#39;s all linked to brain chemistry... When enthusiasm hits it&#39;s like a drug to the system and the barin wants more and more... eventually the rush of discovery pales and you seek new a new stimulus.</p>\n\n<p>You have all the ear marks of a great Hacker by Paul Graham&#39;s definition: curiosity, intelligence, a love for programming as an art...  There are millions more out there of lessor skill and output. You should be justifiably proud of your output... a good business person could lure you into making some money from your passionate desire to build new things... you could have underlings that finish the detail work.</p>\n\n<p>James Gosling, Bill Joy, and dozens of others all had this approach to programming... hack out something new and interesting (java, NeWS, xemacs) and NFS repsectively. Hackers change the world... and sometimes they just invent. Business people turn it to wealth.</p>\n\n<p>Someone should start a &quot;Hacker Labs&quot; that does Internet R&amp;D and sells off these half baked projects for commericalization and a piece of the action... they would need to emerge as &quot;web services&quot; since I don&#39;t think people buy software any longer.</p></div>\n\n        </li>\n\n        <li class=\"comment\" id=\"comment-221082621\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://www.decafbad.com\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=2377f34a68801b861c3e54e1301f0dce&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://www.decafbad.com\">l.m.orchard</a>\n                </div>\n                <a href=\"#comment-221082621\" class=\"permalink\"><time datetime=\"2006-06-02T14:47:12\">2006-06-02T14:47:12</time></a>\n            </div>\n            <div class=\"content\"><p>McD:  Yeah, from some self-observation over the years, I can definitely tell it&#39;s a chemistry thing.  For me, there&#39;s a rush attached to novelty, discovery, and a clean solution to a problem.  The rush wanes over sustained effort on the same thing.  I&#39;m pretty sure it follows all the other familiar response curves in brain chemistry.  This can be mitigated by other factors, like a paycheck or someone&#39;s foot-tapping expectations - but when it&#39;s just me playing, I&#39;m a freewheeling junkie.  :)</p>\n\n<p>But as for the rest of what you wrote - man, are you trying to inflate my head?  Your compliments embarass me.  And also leave me wishing for minions.</p></div>\n\n        </li>\n\n        <li class=\"comment\" id=\"comment-221082622\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://blog.familopia.com\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=65c1e2c00ec5b0fc0fc061d20980c218&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://blog.familopia.com\">Matt</a>\n                </div>\n                <a href=\"#comment-221082622\" class=\"permalink\"><time datetime=\"2006-06-05T08:22:58\">2006-06-05T08:22:58</time></a>\n            </div>\n            <div class=\"content\"><p>i&#39;ll be your minion. though as an entry level programmer, it&#39;s hard to be as prolific as someone like you. i find my web attention span is something like your attention span for new projects. I usually have 20-30 open tabs given the opportunity to just search the web, as its easy to find implementations of my many ideas. i have my own projects, true, and I love to spend my free time on them. i&#39;m personally worried as a computer science about being in situations where the novelty wears off, but I guess that&#39;s what free time is for. I sometimes wonder about people who don&#39;t hack, and how do they manage?</p></div>\n\n        </li>\n\n        <li class=\"comment\" id=\"comment-221082623\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://anotherdilettante.blogspot.com\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=b70fb5f572035f832557a0de488d510f&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://anotherdilettante.blogspot.com\">Penny</a>\n                </div>\n                <a href=\"#comment-221082623\" class=\"permalink\"><time datetime=\"2006-11-07T13:24:27\">2006-11-07T13:24:27</time></a>\n            </div>\n            <div class=\"content\"><p>A long time ago, I read a book called something like &quot;play to your strengths&quot;.  In it, the author said &quot;pick one thing, don&#39;t be a dilettante.&quot;  My immediate reaction was &quot;but my strength is being a dilettante&quot;.</p>\n\n<p>This has played out in what I read up on: when I was a student, I read a lot of books about study techniques.  When I had children, I read lots of books about being a mother/childraising.  When I was a computer programmer, I read a lot about the art of programming.  When I worked for a training department, I read a of books about how to train.  Interestingly, when I stopped being a student, I stopped reading about studying,  when I stopped training staff, I stopped reading about how to train etc.</p></div>\n\n        </li>\n\n        <li class=\"comment\" id=\"comment-221082626\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://randallagordon.com/\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=a895de9f0021b3a08b654fe2efe43e97&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://randallagordon.com/\">Randall A. Gordon</a>\n                </div>\n                <a href=\"#comment-221082626\" class=\"permalink\"><time datetime=\"2009-08-01T06:46:20\">2009-08-01T06:46:20</time></a>\n            </div>\n            <div class=\"content\"><p>Wow, I&#39;ve felt this way my entire life and never had a label for it. And now you&#39;ve provided the perfect term! I constantly wrestle with myself as to whether this is a good trait or a bad one. Since I don&#39;t just jump around with regard to coding, but all types of hobbies that extend into the &#39;ole meatspace. As I enjoy joking about...I even knit from time to time.</p>\n\n<p><p>As well, it appears the latest such source of enthusiasm for the both of us is the Palm Pre! I just wandered in from PreCentral&#39;s forums... I&#39;ll have to keep an eye out for what snippets of serial gold you leave for the rest of us in that world! ;)</p></div></p>\n<pre><code>    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}