{"comments_archived":true,"date":"2005-03-22T00:00:00.000Z","excerpt":"So, what to do in order to freshen up a concept that's suddenly\nenjoying a sort of phoenix rebirth?  Well, apparently, the impulse is\nto (re)name it.","layout":"post","title":"One hundred words for snow","wordpress_id":621,"wordpress_slug":"one-hundred-words-for-snow","wordpress_url":"http://www.decafbad.com/blog/?p=621","url":"/2005/03/22/one-hundred-words-for-snow/","path":"2005/03/22/one-hundred-words-for-snow","content":"<p>About the recent &quot;Ajax&quot; hubbub and REST before it, <a href=\"http://ln.hixie.ch/?start=1111339822&#38;count=1\">Ian Hixie writes</a>:</p>\n<blockquote>\n<p>It&#39;s psychotic! People keep creating new ways to refer to existing technologies. The worst of it is it&#39;s really confusing to those of us who develop these technologies! The other day a reporter contacted some WHATWG members to ask what the relation between Ajax and WHATWG was. That was the first time I heard the name. And now everyone is talking about Ajax as if it&#39;s some sort of new technology, despite the fact that people have been using it for years.</p>\n</blockquote>\n<p>  This makes me want to mangle William Gibson:  <em>The street finds its own terminology for things</em>.</p>\n<p>  The problem, is that lots of people are slower than others to pick up on things.  Or, they think they&#39;ve got it, but stop before they&#39;ve absorbed the entirety of something.    Sometimes they stop because they&#39;re too busy to really explore the thing past surface implications.  Sometimes they stop because it seems absurd or irrelevant at the time--and sometimes they&#39;re right, at the time, and it&#39;s only later that changing conditions revives something as a going concern.</p>\n<p>  Like Podcasting--I mean, they&#39;re &quot;just&quot; RSS enclosures, and those have been around for years.  Except, it&#39;s only now that the proper convergence of broadband, portable media players, and awareness of RSS has emerged that pushed things to the tipping point.  </p>\n<p>  Like &quot;Ajax&quot; (or whatever you (don&#39;t) want to call it)--I mean, technologies like the DOM, CSS, JavaScript, HTTP, and XmlHTTPRequest have been around for years.  But, these things never quite worked right on the older generation of browsers.  It&#39;s only been in the last year or two that I&#39;ve seen a serious critical mass form around dumping support on those aging beasts.  So, it&#39;s only now that these things are really starting to seem worth paying attention to.</p>\n<p>  So, what to do in order to freshen up a concept that&#39;s suddenly enjoying a sort of phoenix rebirth?  Well, apparently, the impulse is to (re)name it.  </p>\n<p>  Because, although the thing itself might not be new, the conversation is.  And, to have a new conversation and we need a fresh handle on which to hang new talk that&#39;s not bogged down by the legacy of the old mental anchor points.</p>\n<p>  Ian <a href=\"http://ln.hixie.ch/?start=1111339822&#38;count=1\">goes on to write</a>:</p>\n<blockquote>\n<p>So I have a request: could people please stop making up new names for existing technologies? Just call things by their real name! If the real name is too long (the name Ajax was apparently coined because &quot;HTTP+XML+HTML+XMLHttpRequest+JavaScript+CSS&quot; was too long) then just mention the important bits. For example, instead of REST, just &quot;HTTP&quot;; instead of DHTML just &quot;HTML and script&quot;, and instead of Ajax, &quot;XML and script&quot;.</p>\n</blockquote>\n<p>  The problem here is that people see &quot;HTTP + XML + HTML + XMLHttpRequest + JavaScript + CSS&quot; and think, &quot;Same old, same old.&quot;  All that comes to mind is likely a big wodge of memories of work experience over the past few years, tired old reams of mailing list and online forum discussions, articles they&#39;ve read.  Actually, it&#39;s likely that some mental boredom filters kick in, and they don&#39;t even see the discussion whatsoever.</p>\n<p>  Well, that, and Ian&#39;s got part of the main concern nailed right in the request: the string of names describing the aggregate concept is far to unwieldy to bear fresh and active thought and discussion.  </p>\n<p>  It&#39;s that whole <a href=\"http://www.well.com/user/smalin/miller.html\">seven-plus-or-minus-two</a> thing, and six words and acronyms just about overflows my stack.  Hell, I had to stick spaces in just to make that string line wrap properly--just imagine what that lead weight does sitting in your headspace.  And, on the other hand, if you &quot;just mention the important bits&quot;, you&#39;re fragmenting the concept and left without a single workable handle again.</p>\n<p>  Oh well, I&#39;d better stop auditioning as amateur cognitive scientist now, before I follow through with this impulse to find some way to recast the whole &quot;<a href=\"http://www.public.iastate.edu/~honeyl/derrida/eskimos.html\">Eskimos have 100 words for snow</a>&quot; myth to suit web developers.</p>\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221083773\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://naeblis.cx/rtomayko/\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=49fa0e19d460d0717dd06b1862d94eb5&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://naeblis.cx/rtomayko/\">Ryan Tomayko</a>\n                </div>\n                <a href=\"#comment-221083773\" class=\"permalink\"><time datetime=\"2005-03-22T10:49:04\">2005-03-22T10:49:04</time></a>\n            </div>\n            <div class=\"content\">I had the same feeling when reading that post. If we take this to the extreme we could probably reduce the entire english language down to ~100 words. Of course, it would take me five minutes to express the concept of &quot;snow&quot;.\n\nI mean, isn&#39;t &quot;HTTP&quot; just another way of saying &quot;MIME Headers and a payload over TCP/IP&quot;? Isn&#39;t &quot;Script&quot; just another way of saying text grammar interpreted at runtime?\n\nMaybe we should just talk in BNF from now on to remove all this &quot;confusion&quot;.</div>\n\n<pre><code>    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083775&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://rasterweb.net/raster/&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=db0fab74bcb564ebb09295498b892fb6&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://rasterweb.net/raster/&quot;&gt;Pete Prodoehl&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083775&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-03-22T12:00:42&quot;&gt;2005-03-22T12:00:42&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;Before podcasting had the name, I tried to explain what I was working on by saying &quot;automated distribution of content via syndication technologies&quot; which, while it sounds cool to some, might not have caught on as a name.&lt;/div&gt;\n\n    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083778&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://www.thok.org/bloggery&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=2545d4ff0ba72eb5d5979186f4b02d85&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://www.thok.org/bloggery&quot;&gt;Mark Eichin&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083778&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-03-22T15:48:51&quot;&gt;2005-03-22T15:48:51&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;Sure, and photomoblogging (ok, that term didn&#39;t catch on either) isn&#39;t anything more than &quot;Web archives that handle mime attachments, in reverse chronological order, fed from your cameraphone email client&quot;.  (A mistake I&#39;ve made more than once, not recognizing that the *packaging* of old boring stuff can bring some new enthusiasm, and even some new comprehension...)&lt;/div&gt;\n\n    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}