{"comments_archived":true,"date":"2005-03-22T00:00:00.000Z","layout":"post","title":"Online social skills","wordpress_id":622,"wordpress_slug":"online-social-skills","wordpress_url":"http://www.decafbad.com/blog/?p=622","url":"/2005/03/22/online-social-skills/","path":"2005/03/22/online-social-skills","content":"<p><em>Here&#39;s something else I&#39;ve had in bubbling around for a little while.  I think there&#39;s more for me to think about here, but here goes:</em></p>\n<p>  Once, when I was a wee lad in the 80&#39;s--probably around the time when the original source for my &quot;When I Grow Up&quot; graphic down at the page bottom was scrawled by my tiny hands--I was on a trip with my Mom and Grandma to visit relatives in Baltimore, MD.  </p>\n<p>  Well, one of the people we visited was a Great Uncle, a nice older man whom I barely remember now.  But, what I do remember--and what gets brought up at least once a year at family gatherings--is this:</p>\n<p>  At the time, I was so all-consumed by my beginning obsession with computers that it was all I wanted to talk about.  After awhile, I&#39;d figured out that most people didn&#39;t know much about computers or didn&#39;t want to talk to me about them.  So, by the time I came around to meeting this Great Uncle of mine, I figured I&#39;d save some time--having begun my love affair with these clean and logical machines, I considered efficiency a virtue.  </p>\n<p>  The first thing I asked him, then, was, &quot;So, do you know anything about computers?&quot;  </p>\n<p>  To this, he responded, &quot;No, sorry, I don&#39;t really know anything about those.&quot;</p>\n<p>  &quot;Well,&quot; I said, without missing a beat, &quot;there really isn&#39;t any use in me talking to you, then.&quot;</p>\n<p>  Of course, my Mother was mortified, and although I don&#39;t really remember it, I&#39;ve been told that my Great Uncle was gracious about it, both surprised and amused.  I think I <em>did</em> end up talking to him about some other things, but this conversation is the only thing which survives in my memory.</p>\n<p>  What reminds me of this story today, though, is a sort of inversion that popped into my head a few minutes ago: </p>\n<p>  &quot;<em>So, can I talk to you with computers?</em>&quot;<br>  &quot;<em>No?</em>&quot;<br>  &quot;<em>Well, there really isn&#39;t any use in me knowing you, then.</em>&quot;</p>\n<p>  Like my Mother years ago, I feel a bit morified that this bubbled up from my subconscious.  I&#39;m afraid of just how true this is about me, and it doesn&#39;t seem very good.  In fact, it seems downright dysfunctional to me.</p>\n<p>  Then again, no one&#39;s ever accused me of being any sort of <em>social dynamo</em>.</p>\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221087010\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://lr2.com/\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=fcb68974d7905521d2a161853a8637b1&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://lr2.com/\">Anton</a>\n                </div>\n                <a href=\"#comment-221087010\" class=\"permalink\"><time datetime=\"2005-03-22T18:37:24\">2005-03-22T18:37:24</time></a>\n            </div>\n            <div class=\"content\">I know how you feel.  My infatuation with computers started back in 1979, and for the most part if anyone didn&#39;t know anything about computers I wouldn&#39;t bother getting to know them.\n\nI&#39;m a little better than that now, but not a lot.\n\nMy dialog could go somthing like this:\n&quot;So, do you know anything about Linux or web development with open source tools?&quot;\n&quot;No?&quot;\n&quot;Let&#39;s find something else to talk about.&quot;\n\nTrouble is that I don&#39;t follow sports, or prime time TV, so there aren&#39;t many subjects to talk about.  Except of course, religion or politics, and that&#39;s generally a bad way to get to know anyone.</div>\n\n<pre><code>    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}