{"comments_archived":true,"date":"2006-02-14T00:00:00.000Z","layout":"post","tags":["asides"],"title":"Pre-sleep bullet points","wordpress_id":880,"wordpress_slug":"pre-sleep-bullet-points","wordpress_url":"http://decafbad.com/blog/2006/02/14/pre-sleep-bullet-points","url":"/2006/02/14/pre-sleep-bullet-points/","path":"2006/02/14/pre-sleep-bullet-points","content":"<p> <p>A few featured bullets from over on my other blog:</p>\n     <ul>\n     <li>\n     <span>I am, of course, a hopeless <a href=\"http://en.wikipedia.org/wiki/Neophile\">neophile</a>.  I believe it&#39;s the only correct orientation toward the future, especially the future as it looks from here.</span>\n     </li>\n     <li>\n     <span><a href=\"http://blogs.opml.org/vacuum/2006/02/13#opmlEditorAndSpotlight\">Ed says that OPML isn&#39;t caught by Spotlight on OS X.</a>  Hmm, I know how to make Spotlight plugins.  I should add that to my <a href=\"http://hosting.opml.org/decafbad/instantOutliner/l.m.orchard.opml\">Maybe Do</a> list.</span>\n     </li>\n     <li>\n     <span>It&#39;ll take me awhile to get down to that Maybe Do list, though, since I&#39;ve got book chapter deadlines as a steady drumbeat on through until mid-March that leave me just a sliver of time for side-hacking in the meantime.</span>\n     </li>\n     <li>\n     <span>Also, Ed: If you&#39;re still having trouble assigning links to blogroll items, I&#39;m wondering if you&#39;ve tried right-clicking / control-clicking on an outline node triangle?  There should be a context menu offering &quot;Add Link...&quot; as an option.  That&#39;ll spawn a dialog you can use to add or modify a URL associated with an outline node.</span>\n     </li>\n     <li>\n     <span>By the way, is anyone else back to using the Instant Outliner these days?  My <a href=\"http://hosting.opml.org/decafbad/instantOutliner/l.m.orchard.opml\">IO is here</a>.  Apologies in advance though:  I&#39;m still trying to work out quite what to use it for, or if the stuff there really belongs somewhere else.  I used to have an IO a few years ago, but drifted away from the habit.</span>\n     </li>\n     </ul></p>\n"}