{"comments_archived":true,"date":"2005-11-27T00:00:00.000Z","layout":"post","tags":["rss","microformats","opml","attention","privacy"],"title":"Subscriptions are attention, but what about blogrolls?","wordpress_id":782,"wordpress_slug":"subscriptions-are-attention-but-what-about-blogrolls","wordpress_url":"http://decafbad.com/blog/?p=782","url":"/2005/11/27/subscriptions-are-attention-but-what-about-blogrolls/","path":"2005/11/27/subscriptions-are-attention-but-what-about-blogrolls","content":"<blockquote cite=\"http://www.dltq.org/?p=763\">But today, for my rss feeds importing and exporting needs, OPML far outshines xoxo.<br /><br />Yes, there are 6 XOXO outlines on my front page. There are six lists. But I don’t have an easy way to import one of those XOXO outlines in my FeedDemon application in order to receive the latest blog items from those blogs that I link to. If there IS an easy way to do it, please enlighten me.</blockquote>\n<small style=\"text-align:right; display:block\">Source: <a href=\"http://www.dltq.org/?p=763#comment-1131\">XOXO vs. OPML at DLTQ.org</a></small>\n\nAh hah.  Here&#39;s a use case where I agree OPML has undeniably become king: Exporting and importing feed aggregator subscriptions.\n\nBecause [Radio UserLand][radio] was the first aggregator to really take off—and because OPML is Radio&#39;s lingua franca, any new aggregators have needed to speak OPML to facilitate migration.  It grew from there, with nearly every aggregator supporting some basic form of OPML import/export for subscription lists.  OPML has won the &quot;feed subscription list format war&quot; before there was ever a notion that there might be such a war.\n\nNow, I&#39;m woefully behind on all the buzz connecting OPML with attention.  But, my impression so far is that people want to share their subscription list, exported from their aggregator of choice.  That comes out as OPML.  So then, the reasoning is that because aggregators produce OPML, and aggregators are powerful attention managers, OPML is the lingua franca of attention.  Is this about right?\n\nI guess where I go from there is with this:  <strong>My aggregator&#39;s OPML export is private data for interchange between my other aggregators.</strong>  Today, I&#39;m about as comfortable with sharing my OPML with you as I am sharing [QIF files exported from my bank account][qif].  Sure, it&#39;s an easy export process, but it&#39;s not meant for you.\n\nIn my OPML, I&#39;ve got subscriptions that I&#39;ve paid for, that I&#39;ve password protected, and that give me details derived from my server logs.  I don&#39;t want to share that, at least not directly.  I&#39;ve been asked for my OPML by a few people so far, and every time, I need to dig through it and be sure I&#39;m not giving away any secrets.  Maybe this is where I&#39;m a bit confused about the attention hype.\n\n<strong>You see, what I do want to share is called a <em>[blogroll][radioblogroll]</em>.</strong>  Blogrolls are <em>public declarations of attention</em>, published on blogs.<br>\nSince revamping this blog, I haven&#39;t yet gotten around to throwing a proper blogroll together, but I&#39;m planning on it.  And, when I <em>do</em> share it, it&#39;ll be in HTML list form.  And when I build it, it may start as an OPML export from my aggregator, but I&#39;ll have to spend some time weeding through it.\n\nI guess I don&#39;t have a clear picture here yet, but directly shipping around exports from my aggregator subscriptions gives me the willies.  And further, basing anything big on OPML gives me the willies too.<br>\nNowadays, sharing things on the web feels like XHTML and [microformats][] to me.  OPML for interchange between aggregators is one thing—but on the web at large, sinking deeper roots into OPML and the whole Rube Goldberg array of machinery following behind it feels like a backward step to me.<br>\nMaybe [microformats][] are the new XML-geekery, but I don&#39;t want a new, &quot;cleaner&quot; XML format—I just want to more cleverly use the format that everyone&#39;s been using to share outlines and declarations of attention in blogs.\n\n[qif]: <a href=\"http://web.intuit.com/support/quicken/2002/win/1177.html\">http://web.intuit.com/support/quicken/2002/win/1177.html</a>\n[radio]: <a href=\"http://radio.userland.com/\">http://radio.userland.com/</a>\n[radioblogroll]: <a href=\"http://radio.outliners.com/blogRollOutliner\">http://radio.outliners.com/blogRollOutliner</a>\n[microformats]: <a href=\"http://www.microformats.org/\">http://www.microformats.org/</a>\n\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221082960\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://plasmasturm.org/\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=e17949267bbfe21a0fadf1bbf00592b4&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://plasmasturm.org/\">Aristotle Pagaltzis</a>\n                </div>\n                <a href=\"#comment-221082960\" class=\"permalink\"><time datetime=\"2005-11-27T21:37:59\">2005-11-27T21:37:59</time></a>\n            </div>\n            <div class=\"content\"><p>Check out <a href=\"http://copia.ogbuji.net/blog/\" rel=\"nofollow\">Uche Ogbuji</a>&#39;s pertinent posts:</p>\n\n<ol>\n<li><a href=\"http://copia.ogbuji.net/blog/2005-11-14/I_already_\" rel=\"nofollow\">I already said OPML is crap, right? I had to hack through another reminder today.</a></li>\n<li><a href=\"http://copia.ogbuji.net/blog/2005-11-15/I_must_be_\" rel=\"nofollow\">I must be missing something about XOXO (and maybe microformats in general)</a></li>\n<li><a href=\"http://copia.ogbuji.net/blog/2005-11-16/Does_it_co\" rel=\"nofollow\">XOXO versus Atom versus XBEL for Web feed lists?</a></li>\n</ol></div>\n\n        </li>\n\n        <li class=\"comment\" id=\"comment-221082961\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://oo2contml.sf.net\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=a5d42c1ccacf33c72fd502fe1bb5ffa9&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://oo2contml.sf.net\">Adam Lindsay</a>\n                </div>\n                <a href=\"#comment-221082961\" class=\"permalink\"><time datetime=\"2005-11-28T11:48:40\">2005-11-28T11:48:40</time></a>\n            </div>\n            <div class=\"content\"><blockquote>\n  <p>My aggregator’s OPML export is private data for interchange between my other aggregators.</p>\n</blockquote>\n\n<p>See, that&#39;s where you&#39;ve lost me. Regardless of OPML&#39;s suckiness (yes, I&#39;ve gazed on it, first hand), export/import interchange formats are precisely the sort of thing to be open standards. I spent many of the prime years of my life working on MPEG, and that, if anything, was my take-home message. The interchange/glue formats are precisely what need to be scrutinised and kept in public view.</p>\n\n<p><p>Is OPML good for anything else? Not really. Should it be promoted for all one&#39;s outlining needs? Not really. Does XOXO have an easy time of gaining mindshare, considering most people&#39;s miniscule outlining needs? Not really.</p></div></p>\n<pre><code>    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}