{"comments_archived":true,"date":"2006-02-26T00:00:00.000Z","layout":"post","title":"The OPML Editor means Getting Things Blogged","wordpress_id":905,"wordpress_slug":"the-opml-editor-means-getting-things-blogged","wordpress_url":"http://decafbad.com/blog/2006/02/26/the-opml-editor-means-getting-things-blogged","url":"/2006/02/26/the-opml-editor-means-getting-things-blogged/","path":"2006/02/26/the-opml-editor-means-getting-things-blogged","content":" <p>Lisa Williams points to <a href=\"http://blogs.opml.org/thisislisa/2006/02/26#offlineEditorsAreFromMarsTheOpmlEditorIsFromVenus\">OPML blogging bewilderment</a> from authors of a desktop blogging client, <a href=\"http://qumana.com/\">Qumana</a>.  <a href=\"http://blogs.opml.org/decafbad/2006/02/12#lightningFastBloggingWithTheOpmlEditor\">I compared the OPML Editor to a cavitating torpedo.</a>  It&#39;s just fast and uncomplicated - it&#39;s light on formatting features, but that itself is a feature.  I type, and save, and I&#39;m published.  I could post 60 entries in a minute, maybe more.  (I type pretty fast, think faster.)  When I open the day&#39;s outline, I&#39;m not Faced with the Task of Composing a Document, I&#39;m faced with a structure based on luring atomic thoughts out of my head.  Ready, fire, aim.  That&#39;s the blogging style here.</p>\n <p>I come back here later; I can post another entry; move it around; expand on an idea; restructure atomic ideas into a molecule of a larger entry.  The day&#39;s context and history remain splayed out for my perusal.  The day is a fine unit of continuity for a run of thought.  Further on through the course of thought, I can move into a richer tool if I feel I&#39;ve got enough from which to Compose a Document - but until then, at least I haven&#39;t wedged the mechanisms.  I&#39;ve gotten it out of my head.  <a href=\"http://en.wikipedia.org/wiki/Gtd\" title=\"GTD rests on the principle that you have to get things out of your head and recorded into a system you can trust.\">Getting Things Done, blogger style</a>.</p>\n <p>Since I started playing with this tool for blogging, I&#39;ll bet that I&#39;ve gotten more out of my head and onto the web in just over two weeks than I have in the past six months.  <a href=\"http://decafbad.com/blog/2002/03/26/oooofa\">This has been a theme in my blogging for quite some time now.</a>  So, you can probably imagine why finding what looks like a solution to the problem has induced such enthusiasm in me.</p>\n"}