{"layout":"post","title":"The Readerpocalypse, or Occupy Google Reader","tags":["rss","atom","feeds","google","reader","metablogging","occupygooglereader"],"published":true,"date":"2011-11-01T00:00:00.000Z","url":"/2011/11/01/readerpocalypse/","thumbnail":"http://decafbad.com/blog/images/2011/11/Newspaper_Feed_256x256.png","path":"2011/11/01/readerpocalypse","content":"<p><strong>TL;DR</strong>: <em>Google gave Reader a face-lift and removed built-in\nfollowing &amp; sharing. In exchange, they added +1 buttons and ways to\nshare to Google+. But, the changes seem to have removed most of the\nvalue from the service for me, so I&#39;m moving on as I was invited to\ndo.</em></p>\n<p><span style=\"display: block; float: right; text-decoration: none; border: none; margin: 0 0 1em 1em\"><img src=\"http://decafbad.com/blog/images/2011/11/Newspaper_Feed_256x256.png\" style=\"width: 256px\" /></span></p>\n<h2 id=\"what-happened-\">What happened?</h2>\n<p>Almost a year ago, I wrote about how my habits had gotten\n<a href=\"http://decafbad.com/blog/2010/12/18/less-del-icio-us-than-ever-before\">less del.icio.us</a>. One of the main culprits that stole my sharing\nflow was <a href=\"http://reader.google.com\">Google Reader</a>: I went from using a quick bookmarklet to an\neven quicker icon-click in my feed reader. That meant I left most\nthings <a href=\"http://pinboard.in/u:deusx/untagged/\">untagged</a>, but I shared even more than before. Eventually,\nGoogle Reader released a bookmarklet for use off-site, which\nmeant I started sharing everything everywhere to Reader.</p>\n<p>I also found a replacement for my old del.icio.us network in Google\nReader&#39;s social features. I could follow people, and the stream of\nthings <em>they</em> shared and annotated turned into a great source of\nnews curated and pre-filtered by likeminded people.</p>\n<p>Well, as it turns out, Google&#39;s <a href=\"http://googlereader.blogspot.com/2011/10/new-in-reader-fresh-design-and-google.html\">recent changes</a> to Reader just\nremoved all of the above. In exchange, they added a couple of buttons\nto +1 and share items to Google+, which streamlines things for them\nand encourages more use of the new service.</p>\n<p><a href=\"https://plus.google.com/114487965928288927815/posts/fgscQet4kxh\">As I wrote</a> on Google+, the net result is nothing to stomp and\nshout about, but there&#39;s nothing there that makes me happier. As I\nplayed more, though, I came to realize that most of the value\nI derived from the service had evaporated.</p>\n<h2 id=\"item-centric-vs-people-centric-efficiency-vs-engagement\">Item-centric vs People-centric, Efficiency vs Engagement</h2>\n<p>There&#39;s a big difference between the way sharing happened on Google\nReader, and the way it happens now on Google+. The best way I can\nthink to explain is that the old way was item-centric and the new way\nis people-centric.  In other words, <em>people</em> seem to be the dominant\n<a href=\"http://www.slideshare.net/jyri/microblogging-tiny-social-objects-on-the-future-of-participatory-media\">social objects</a> in Google+, whereas Google Reader used to treat\n<em>items</em> that way.</p>\n<p>Before, we all gathered around the news. The headline and summary were\nprimary, and our comments were collected after the item. The result\nwas a de-duped stream of great news filtered through smart brains.\nEven if the people I followed never said a word, the fact that they&#39;d\nclicked &quot;share&quot; was value enough. In fact, it was better that\nway most of the time, because we all got out of the way of each other\nand the news.</p>\n<p>This, by the way, is what I loved about del.icio.us and now\n<a href=\"http://pinboard.in/u:deusx\">pinboard.in</a>: It&#39;s anti-social networking. We can provide\nlow-effort, intelligent inputs to build something useful for each\nother, but we&#39;re not there to assert a presence or distract each other\nfrom the things we each came to see.</p>\n<p>But now, that filtered news stream is gone. In its place, on a\ndifferent site entirely, removed from the flow of feeding on news, is\na highly-engaging flood of people babbling away, which occasionally\nincludes repeated shares of things that have bubbled up during the\nday.</p>\n<p>What&#39;s wrong with that, for me?</p>\n<ol>\n<li>I don&#39;t want to wade through a heavily-padded, user-friendly flood\nof duplicated, echoed items.</li>\n<li>I don&#39;t want to engage with the people—at least, not when I&#39;m in a\nmood to feed on news. I want to catch up on what&#39;s been put out\ninto the infosphere already, and <em>then</em> start talking about it.</li>\n</ol>\n<p>The design of Google+—which has spilled over into the Google Reader\nface-lift—is about engagement and not fast &amp; efficient processing of\nthe day&#39;s news. Engagement in general puts a drag on the task—which\nfor me is like a <a href=\"http://www.davidco.com/about-gtd\">GTD</a>, <a href=\"http://inboxzero.com/\">Inbox Zero</a>, headline skimming, pattern\nrecognition zen thing that might not be everyone&#39;s cup of tea.</p>\n<p>But, for all I know, avowed weirdo and <a href=\"http://decafbad.com/blog/2004/10/11/allgrowedup\">info freako</a> that I am,\nthese changes may drive Google Reader growth through the roof for\nmainstream users.  But, it&#39;s no longer a product for me. The changes\nin sharing have removed most of the value for me, because I no longer\nhave the warp speed cruise through news that other people used to\npower for me.</p>\n<h2 id=\"circles-point-the-wrong-way\">Circles point the wrong way</h2>\n<p>One of the things <a href=\"https://plus.google.com/100535338638690515335/posts/95ZsWiCG3xS\">Louis Gray touted about the new sharing\nfeatures</a> reads like so:</p>\n<blockquote>In Reader’s previous sharing model, as a follower of your\nitems, I would see every single item you shared, no matter what it was\nabout. Obviously, as I have different interests than you do, not\neverything you shared was something I cared about, which often led to\nreduced sharing of off-topic content. Now, you are more in control, so\nyou can share sports items to your sports circles, great recipes with\nyour foodies circle, or local news to family and friends. You can keep\nsharing, like you always have, but now, you can better select who sees\nwhat.</blockquote>\n\n<p>But, for this purpose, Circles point the wrong way.</p>\n<p>Circles on Google+ are lists of people controlled by me. They&#39;re not\ntopics—again, people-centric and not item-centric. Circles are a\ntargeting mechanism for sharing to people, and a filtering mechanism\nfor items from people.  That is, I can use a circle to set who sees\nsomething and I can decide who&#39;s stuff I see and when.</p>\n<p>But, things that Circles don&#39;t do include:</p>\n<ul>\n<li><p>Letting me follow Circles without the Circle-owner needing to manage\nmembership - eg. Don&#39;t make me send a message saying &quot;I am\ninterested in your ideas and would like to subscribe to your\nnewsletter&quot;. RSS doesn&#39;t work that way and it&#39;s better for it.</p>\n</li>\n<li><p>Letting me and others filter for what gets sent to specific Circles -\neg. I&#39;m in both your &quot;scifi&quot; and &quot;politics&quot; circles, but just show\nme what you sent to your &quot;scifi&quot; circle.</p>\n</li>\n</ul>\n<p>Google Reader didn&#39;t have this to begin with, but what I&#39;m looking for\nis an equivalent to tagging on <a href=\"http://pinboard.in/u:deusx\">pinboard.in</a>. For example, if you\nlike my taste in <a href=\"http://pinboard.in/u:deusx/t:scifi\">scifi</a> but could care less about my views in\n<a href=\"http://pinboard.in/u:deusx/t:politics\">politics</a>, you can subscribe to just the tag feeds you want.</p>\n<p>I&#39;m happy to tag my shares with topics; that&#39;s beneficial to me for\nsearch later, and helps interested people besides. But, the last thing\nI want to do is manage subscriber lists. That doesn&#39;t scale. There&#39;s\nno way for you to even know I have &quot;scifi&quot; or &quot;politics&quot; Circles, and\nyou have no way to join either of them without asking for an add.</p>\n<p>Too much coordination, not enough benefit. I just can&#39;t see the value\nin people-centric Circles here.</p>\n<h2 id=\"other-things-broke-too-\">Other things broke, too.</h2>\n<p>And beyond the fundamental shift in sharing and reading, these things\nhave broken for me now too:</p>\n<ul>\n<li>The bookmarklet is dead, so there goes my off-site sharing.</li>\n<li>No sharing at all from the <a href=\"http://google.com/reader/i/\">mobile web version</a>, so there goes at\nleast half of my sharing on-site.</li>\n<li>Android apps like my favorite <a href=\"https://market.android.com/details?id=com.noinnion.android.greader.readerpro&amp;hl=en\">gReader Pro</a> still think sharing\nworks, but they&#39;re just deluded and use an unsupported API anyway</li>\n<li>No more feed to Facebook, so there goes most of <a href=\"http://www.facebook.com/lmorchard\">my Facebook\noutput</a>. (Though, that might be a boon some friends over there.)</li>\n</ul>\n<h2 id=\"now-what-\">Now what?</h2>\n<p>The remaining value of Google Reader is as just a plain old hosted\nfeed reader—one of the last of them out there, in fact. The problem\nhere is that I&#39;m a weirdo who wrote <a href=\"http://www.amazon.com/gp/product/0764597582?ie=UTF8&amp;tag=0xdecafbad01-20&amp;linkCode=as2&amp;camp=1789&amp;c%0D%0Areative=9325&amp;creativeASIN=0764597582\">a book on feeds and feed readers</a>,\nand so I&#39;m perfectly capable of providing the remaining\nvalue for myself.</p>\n<p>I&#39;m sure most people won&#39;t want to do that, which is probably why\n&quot;<a href=\"http://www.readwriteweb.com/archives/alternatives_to_google_reader.php\">you&#39;re not going anywhere</a>&quot;. But, there are alternatives even for\npeople who don&#39;t want to D.I.Y. entirely:</p>\n<ul>\n<li><p>Dave Winer&#39;s <a href=\"http://river2.newsriver.org/\">River2</a> (also open source, in UserTalk on the <a href=\"http://home.opml.org/\">OPML\nEditor</a>) runs on my laptop and lets me circle back to the code\nthat ran my second-ever news reader, <a href=\"http://radio.userland.com/\">Radio UserLand</a>.  (My first\nwas a thing called <a href=\"http://newsclipper.sourceforge.net/\">News Clipper</a> in Perl from many, many moons\nago.) And, of course, <a href=\"http://river2.newsriver.org/\">River2</a> is one of a suite of apps Dave&#39;s\nworking on to build a decentrallized network of feeds and outlines.</p>\n</li>\n<li><p><a href=\"http://newsblur.com\">NewsBlur</a> looks mighty fine, and <a href=\"http://www.samuelclay.com/\" title=\"Samuel Clay, that is\">the guy running it</a> only asks\nUS$12-36 (your choice) for a year&#39;s worth of premium access.\nRemember: if you&#39;re not the customer, you&#39;re the product. And, if\nyou want to try installing it, it&#39;s an <a href=\"https://github.com/samuelclay/NewsBlur\">open source Django\nsite</a>. While not yet very social, <a href=\"http://newsblur.com\">NewsBlur</a>&#39;s\ncreator <a href=\"http://blog.newsblur.com/post/11956240785/a-social-feed-reader\">has plans</a> to head in that direction.</p>\n</li>\n<li><p><a href=\"http://tt-rss.org/\">Tiny Tiny RSS</a> installed on my Wordpress-capable web server in\nabout 10 minutes, gobbled up my list of 800 feeds with no problem,\nand appears to have 90% of what I wanted from Google Reader. Also,\nit&#39;s <a href=\"https://github.com/gothfox/Tiny-Tiny-RSS\">an open source PHP site</a>. For sharing, <a href=\"http://tt-rss.org/\">Tiny\nTiny RSS</a> lets you &quot;publish&quot; shared items in an RSS feed—kind of\nlike the old <a href=\"http://reblog.org/\">reBlog</a> web app—and has some experimental\ncross-instance sharing features.</p>\n</li>\n</ul>\n<p>At the end, the funny thing is that I&#39;ve circled back to my old\ndel.icio.us habits and have started tagging items on <a href=\"http://pinboard.in/u:deusx\">pinboard.in</a>\nlike never before. I&#39;m sure there aren&#39;t nearly as many people\nwatching me as before on either del.icio.us or Google Reader, but it&#39;s\na place to go at least.</p>\n<p>It&#39;ll probably be recognized as an illness\nsomeday, but my sharing feels compulsive at this point and I get itchy\nwithout a good outlet.</p>\n<!-- vim: set wrap wm=5 syntax=mkd textwidth=70: -->\n"}