{"comments_archived":true,"date":"2005-01-07T00:00:00.000Z","excerpt":"I've been wondering lately whether I've gone too far in cultivating\nwhat I understand as a \"beginner's mind\" in myself.","layout":"post","title":"Beginner's Mind versus Teacher's Mind","wordpress_id":583,"wordpress_slug":"beginners-mind-versus-teachers-mind","wordpress_url":"http://www.decafbad.com/blog/?p=583","url":"/2005/01/07/beginners-mind-versus-teachers-mind/","path":"2005/01/07/beginners-mind-versus-teachers-mind","content":"<p><blockquote>To me, in its simplest form, the beginner&#39;s mind is a state of eager anticipation of learning something new, but without preconceptions about what is to be learned.  For me, the great challenge -- and the great rewards -- of cultivating the beginner&#39;s mind lie in maintaining it in the face of actual learning.  Learning means building a knowledge base and conceptual framework.  Maintaining a beginner&#39;s mind means actively welcoming information and ideas that may require me to abandon what I&#39;ve already built and to start building anew -- and to find joy in the task. </blockquote></p>\n<div align=\"right\"><small>Source: <cite><a href=\"http://www.beginners-mind.net/what_is.htm\">What is the Beginner&#39;s Mind?</a></cite></small></div>\n\n<p>I&#39;ve been wondering lately whether I&#39;ve gone too far <a href=\"http://www.decafbad.com/blog/2002/06/13/oooaih\">in cultivating</a> what I understand as a &quot;<a href=\"http://www.google.com/search?q=beginner%27s+mind\">beginner&#39;s mind</a>&quot; in myself.  One of the roles I&#39;ve always wanted to grow into is that of an expert and a teacher, and part of that has been wanting to write more tutorial-style pieces for this place.  Having just gotten <a href=\"http://www.decafbad.com/blog/2005/01/07/belated_happy_new_year\">the opportunity to write a book</a> certainly makes me feel like I&#39;m making big progress toward this.  However, due to habits of thought I&#39;ve developed in adopting this &quot;beginner&#39;s mind&quot;, I&#39;ve been having trouble figuring out what&#39;s worth writing about and about what I&#39;m worthy of writing.</p>\n<p>In learning, I&#39;ve tried to keep an open and unassuming mind about things.  And even after I have learned quite a bit about something, and I can demonstrate obvious expertise with something to anyone who&#39;s watching, I still consider myself a beginner.  There&#39;s always someone who knows more about that thing than I do--from whom I want to learn even more--so I don&#39;t ever want to let myself feel like <em>I&#39;ve arrived</em> and allow my learning to be clouded.</p>\n<p>So herein lies the rub: If I&#39;m always a beginner, how can I ever be a teacher?  It&#39;s not so much a rational issue--it&#39;s more an issue of emotion and habits of thought.  Rationally, I think it&#39;s safe to say that as I learn about something, I climb up a ladder of experts&#39; shoulders.  And below me, still down the ladder, are other beginners doing the climb.  But where I run into trouble is in trying to figure out where I am on the ladder, and where and how I should make myself available as a rung.  Because, there are so many others at and above my level already providing their shoulders, and the climb still has so much farther yet to go above me.  </p>\n<p>Now this metaphor has its problems, since it&#39;s neither charitable nor useful to me to think of others as above or below me in any competitive or evaluative sense.  Although amassing a lot of skill and expertise can take me places and get me better compensation, this isn&#39;t a zero-sum game in my mind.</p>\n<p>But anyway, my hangup remains the same:  About what should I be writing, and who am I to be writing about it?</p>\n<p>I don&#39;t have any good answers yet.  There are a lot of things I know for which I don&#39;t have much regard--because back in my head I tell myself that they can&#39;t be worth too much since, well, <em>I</em> know them, and <em>I&#39;m just a beginner</em>.  But then I catch some new trick or buzz making the rounds, and I realize that maybe I knew about it a few years ago and could&#39;ve been writing reams about it.  </p>\n<p>I&#39;ve thought that maybe I should start taking an inventory of all the things I think I can do and all the things I think I&#39;ve learned.  Maybe I could put this list online, and ask anyone who cares to drop me a note or maybe cast a vote for whatever they think I should write about.</p>\n<p>But, bah:  This sounds like a cute (as in My Little Pony) yet brain-dead (as in eating paint chips) idea to me, really.  It&#39;s a bit cloying like <a href=\"http://home.hawaii.rr.com/snlcn/franken/stuart.html\">Stuart Smalley</a> and the self-help book of the month.  Maybe it&#39;d be more productive if I just started picking topics and started <em>writing</em> to see what sticks--be perverse about it, even, and pick what I think is the most worthless thing to write about and have at it.</p>\n<p>Coming up next on 0xDECAFBAD: <strong>Podcasting for cats.</strong></p>\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221083450\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"http://lion.taoriver.net/\"><img src=\"http://www.gravatar.com/avatar.php?gravatar_id=b49f34733c8d7cf1120f83d6c21433df&amp;size=32&amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"http://lion.taoriver.net/\">Lion Kimbro</a>\n                </div>\n                <a href=\"#comment-221083450\" class=\"permalink\"><time datetime=\"2005-01-07T18:07:07\">2005-01-07T18:07:07</time></a>\n            </div>\n            <div class=\"content\">I wish there were a good book on how to be an Open Source hacker. (More motivational than, say, the Art of Unix Programming.) Something inspiring, practical, with a vision, and a way.\n\nThen I could give it to everybody who&#39;s interested in that path.\n\nI meet a LOT of people, while writing things here and there, who want to know how to get involved.\n\nThere should be a special section for people who are in college. There should be a section on setting up a blog, and a wiki. There should be a section on mental habits. There should be a section on social networking in the local area. There should be a section on: &quot;Now that I&#39;ve written this thing, how do I get people to use it?&quot; (Programmers face marketing face to face, for the first time in their life.)\n\nAll these little practical things that are involved in participating online, and stuff.\n\nIt would need to be written with a lot of Love and encouragement. And you don&#39;t need to write it in &quot;Ah-hah; Now I am the Master&quot; mode. I hate it when books do that: &quot;I&#39;m the author, hear me roar, because I know everything.&quot; That&#39;s really sucky.\n\nWell: This is something that I wish for a lot. And I know a lot of people want to know what is written and drawn in the (presently) etherial pages of this book.\n\nThe goal is to help the people who want to become programmers in our new public space to do so.\n\nIf I were writing it, I&#39;d write a tiny smidgeon about the big picture we&#39;re involved in, too. Tell us a little about your ideals, where you see us heading, something to give it heart.\n\nJust all this stuff. Sort it out, write it out, and thereby manufacture 100 new participants in our fun space. That&#39;d be really cool.\n\nAgain: People WANT to know this stuff. I keep running into these people. They want to know how to master their habits so that they can program every day. They want to contribute. There&#39;s all these hurdles. We both know the work is on their end, but it&#39;s possible to help, by drawing the path in chalk marks.\n\nBut, I don&#39;t know. Maybe you can&#39;t get a book contract like that so easy. And it&#39;s arguable whether it&#39;s more worthwhile to work on Comm tech, rather than explaining how to work on Comm tech.</div>\n\n<pre><code>    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083452&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://blog.ianbicking.org&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=cc8334869c9d2a9e603017f2da805eb3&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://blog.ianbicking.org&quot;&gt;Ian Bicking&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083452&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-01-07T18:36:15&quot;&gt;2005-01-07T18:36:15&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;One of the nice things about a blog is that you can write questions as well as you can write answers, and often they are just as useful to the reader, at least if they are questions backed up with experience.  Not so easy to do in a book, since a book implies authority, a lack of timeliness or transience, and a lack of a personal voice.&lt;/div&gt;\n\n    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083455&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://kristopherjohnson.blogspot.com/&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=94316c708a352c88a9ca083db9bb72a7&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://kristopherjohnson.blogspot.com/&quot;&gt;Kris Johnson&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083455&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-01-07T18:48:18&quot;&gt;2005-01-07T18:48:18&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;I&#39;ve thought along these lines myself over the years. I like writing, and I&#39;m sure there is stuff I know that would be useful to others, but all the really interesting stuff is stuff that I am still learning.\n</code></pre><p>I wrote my own blog entry about this subject a couple of months ago: <a href=\"http://kristopherjohnson.blogspot.com/2004/11/on-writing.html\">http://kristopherjohnson.blogspot.com/2004/11/on-writing.html</a></div></p>\n<pre><code>    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083457&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://novemberborn.net/&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=ad418e3e53e0ba71ba56b7df978671e8&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://novemberborn.net/&quot;&gt;Mark Wubben&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083457&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-01-08T08:55:00&quot;&gt;2005-01-08T08:55:00&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;Why don&#39;t you write as a beginner? Look at things with a blank mind, and figure out / explain how things work. It would probably resonate with other beginners more.\n</code></pre><p>More along these lines here: <a href=\"http://headrush.typepad.com/creating_passionate_users/2005/01/your_users_brai.html\">http://headrush.typepad.com/creating_passionate_users/2005/01/your_users_brai.html</a></div></p>\n<pre><code>    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083458&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://www.skipjack.info&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=0546eacc913ab1198d1142d3e945b9a4&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;http://www.skipjack.info&quot;&gt;skipjack&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083458&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-01-08T21:07:16&quot;&gt;2005-01-08T21:07:16&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;I have had to teach a couple of courses in my life, the thing that has helped me was start writting about the process of how you got all the knowledge you have. After you have finished that set it down for a week or so and then pick it up and read it with a fresh mind. You will catch alot of assumentions you left out, fill them in. Once again set it down for a week, then read it word for word with a beginner’s mind and see if it makes sense. What ends up happening is that the book shows a process of learning and shows that while you may be ahead of the person your teaching , you still have quite a bit mnore to learn. And by teaching them you are bring them up to your level so both of you can learn the next level together.&lt;/div&gt;\n\n    &lt;/li&gt;\n\n    &lt;li class=&quot;comment&quot; id=&quot;comment-221083459&quot;&gt;\n        &lt;div class=&quot;meta&quot;&gt;\n            &lt;div class=&quot;author&quot;&gt;\n                &lt;a class=&quot;avatar image&quot; rel=&quot;nofollow&quot; \n                   href=&quot;&quot;&gt;&lt;img src=&quot;http://www.gravatar.com/avatar.php?gravatar_id=da828f7f73d835410ab83894eee2db42&amp;amp;size=32&amp;amp;default=http://mediacdn.disqus.com/1320279820/images/noavatar32.png&quot;/&gt;&lt;/a&gt;\n                &lt;a class=&quot;avatar name&quot; rel=&quot;nofollow&quot; \n                   href=&quot;&quot;&gt;William Pietri&lt;/a&gt;\n            &lt;/div&gt;\n            &lt;a href=&quot;#comment-221083459&quot; class=&quot;permalink&quot;&gt;&lt;time datetime=&quot;2005-01-24T17:01:51&quot;&gt;2005-01-24T17:01:51&lt;/time&gt;&lt;/a&gt;\n        &lt;/div&gt;\n        &lt;div class=&quot;content&quot;&gt;You seem to think being a beginner and being a teacher are opposed. But good teachers are always learning more about their subject. I don&#39;t think beginner&#39;s mind requires you to deny what you know or to unfairly slight yourself in comparison with others. What it requires is to be humble in the face of how much more you have yet to learn.\n</code></pre><p>Perhaps the way to apply beginner&#39;s mind here is in constantly making fresh appraisals of yourself and others, in always being open to opportunities to teach as well as to learn.</div></p>\n<pre><code>    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}