{"comments_archived":true,"date":"2005-01-07T00:00:00.000Z","layout":"post","title":"Belated Happy New Year!","wordpress_id":581,"wordpress_slug":"belated-happy-new-year","wordpress_url":"http://www.decafbad.com/blog/?p=581","url":"/2005/01/07/belated-happy-new-year/","path":"2005/01/07/belated-happy-new-year","content":"<p>That was a good, lazy, and mostly offline holiday break.  I spent most of the week between Christmas and the New Year in new pajama pants with <a href=\"http://missadroit.livejournal.com\">The Girl</a>, playing video games, visiting family and friends, and mostly regenerating frazzled neurons.  But now, I&#39;ve been back to work for most of a week and I&#39;m just now slowly reconnecting to things.  Hopefully the time off did me some good and you&#39;ll see some more regular activity from me.  Let&#39;s see, how&#39;s the new year looks from here...</p>\n<p>The Book</p>\n<p>Yes, <strong>The Book</strong>.  One of the things that came out of the tail end of 2004 for me is that I&#39;ve signed a contract with <a href=\"http://www.wiley.com/WileyCDA/\">Wiley</a> to write a book in their <a href=\"http://www.extremetech.com/category2/1,3971,1366100,00.asp\">ExtremeTech series</a> about some advanced hands-on hacking with RSS and Atom feeds.  Not sure how much I should let slip about what I&#39;ve got planned, but I will be stuffing in a big chunk of everything I know about syndication feeds in working code and tinkering.</p>\n<p>Now, I&#39;ve got a long way to go, and a lot of work ahead, but this is something I&#39;ve been wanting to do since I decided <a href=\"http://www.decafbad.com/images/growup.jpg\">what I wanted to be when I grew up</a>.  Granted, I know this won&#39;t be any grand classic, but it will be a book written by me, and that&#39;s pretty damn nifty.  I suppose I could&#39;ve always just gotten myself together and written a book on my own <a href=\"http://diveintomark.org/archives/2002/04/19/mine_does\">like Mark Pilgrim did</a>, but I think I need someone tapping a foot and pointing at a watch in order to get me sorted out and really moving.  I can be pretty self-starting and self-motivating, but there&#39;s nothing like a deadline to make me hustle.</p>\n<p>So, yeah:  My first book.  Here&#39;s hoping I survive and make it out with my interest in the topic still intact; that I&#39;ll still want to write many more when I&#39;m done with this one; and that it pulls in some very healthy sales so I&#39;ll be asked to write more.</p>\n<p>The Blog</p>\n<p>So, now that I&#39;ll be pouring tons of my writing energy into a book, what does that mean for this place?  Well, oddly enough I&#39;m guessing that it will make me write more here.  I haven&#39;t been precisely prolific here in awhile, but I think once I&#39;ve gotten something like a critical mass of writer-class thinking going in my head, I&#39;ll have spill-over on other topics to spew here.    I&#39;ve got a few mini-project / tutorial ideas I&#39;d like to pursue, not to mention finishing <a href=\"http://www.decafbad.com/blog/2004/12/23/abook1\">what I started</a> before the new year.</p>\n<p>That, and this place is getting pretty close to its third birthday, so I&#39;ve been thinking again about how I might revamp it.  Granted, my idea output over the last year has been lighter than in the past, and I haven&#39;t been using the <a href=\"http://www.decafbad.com/twiki/bin/view/Main/WebHome\">wiki</a> side of this site all that much.  The few idea-lets I <em>have</em> had have been finding their way into <a href=\"http://www.eastgate.com/Tinderbox/\">Tinderbox</a> notes instead, but I have yet to play much with exporting and publishing from <a href=\"http://www.eastgate.com/Tinderbox/\">Tinderbox</a>.  So, I&#39;ve been musing a bit about how I might capture and publish a bit more of my random ideas that don&#39;t quite fit as full blog posts, links, or longer-term wiki page growths.</p>\n<p>Although I love the idea of wiki, my use of wiki here is more or less as a glorified low-friction micro-CMS for my ideas.  I do welcome comments and contributions, but I don&#39;t particularly care for or go out of my way to encourage full-on wiki collaboration here.  So, I&#39;ve been wondering if maybe what I really want is not a wiki, but a web of published Tinderbox notes with comments and trackbacks enabled?  </p>\n<p>Anyway, that&#39;s enough rambling for the moment.  I&#39;ll be back soon, maybe after lunch.</p>\n"}