{"title":"Behemoth, Part 1","author":"lmorchard","layout":"post","permalink":"/2013/06/11/behemoth-part-1","dsq_thread_id":[1388516325],"categories":["Uncategorized"],"tags":["behemoth","fiction","scifi","spaceopera"],"date":"2013-06-11T00:00:00.000Z","url":"/2013/06/11/behemoth-part-1/","summary":"<p><em>I&#x2019;ve been meaning to get myself writing again, so here&#x2019;s the first rough part of a story that&#x2019;s been bouncing in my head. It&#x2019;s a quick and dirty opening scene for a space opera, but I&#x2019;m hoping to take it in an interesting direction almost immediately after this.</em></p>\n<p>A distant sun cast silvery rays through a field of tumbling asteroids and swirling dust. Among the rocks, a balletic swarm of glinting motes danced, alighting here and there to vaporize and harvest masses with actinic flares. The source and sink of the swarm&#x2019;s flow was a dark, ovoid craft tracing a lazy, eccentric orbit around the cluster of debris. Nestled within the craft was its pilot, Alan Rickard.</p>\n","path":"2013/06/11/behemoth-part-1","content":"<p><em>I&#8217;ve been meaning to get myself writing again, so here&#8217;s the first rough part of a story that&#8217;s been bouncing in my head. It&#8217;s a quick and dirty opening scene for a space opera, but I&#8217;m hoping to take it in an interesting direction almost immediately after this.</em></p>\n<p>A distant sun cast silvery rays through a field of tumbling asteroids and swirling dust. Among the rocks, a balletic swarm of glinting motes danced, alighting here and there to vaporize and harvest masses with actinic flares. The source and sink of the swarm&#8217;s flow was a dark, ovoid craft tracing a lazy, eccentric orbit around the cluster of debris. Nestled within the craft was its pilot, Alan Rickard.</p>\n<!--more-->\n<p>He was on the verge of dozing off, despite the displays rendered across the insides of his eyelids in lurid neon phosphenes. Transit arcs and cargo reports flickered, narrating the progress of his mining. All estimates gave him at least another four hours before the holds were full. Only then would the system would need his manual input to reel everything in and head for home.</p>\n<p>His eyes had just closed for a long, drowsy blink when a sharp series of pings yanked him awake with a gasp. He pushed the mining interface into the background and summoned up a sensor sweep: Four bogeys had just translated into local space. They began accelerating toward him in an unsettling formation, their vectors suggesting only minutes before he&#8217;d be within their weapons range.</p>\n<p>He sent a hail over the local comm channel. He held his breath for a few beats, but received the expected response: One of the ships pegged him with a scrambler, blocking both long range comms and hyperdrive. His sensors were pretty fuzzy, too. Standard procedure for pirates, so far &#8211; typically checkmate against a mining platform like his.</p>\n<p>But, he still had laser links to his motes in the rocks, and he had a project he&#8217;d been saving for just this scenario. He fired up his sublight engines and plotted a course into the thick of the debris. Then, he fired off a burst of instructions: The motes abandoned their tasks and rebooted into Alan&#8217;s own homebrew firmware.</p>\n<p>Individually, the mining motes were nimble, but had weak sensors and processors. As the new software came online, the motes established a distributed system spread across the debris field using redundant and scrambler-proof laser links. In conjunction with his ship, the system as a whole gained capabilities that Alan hoped would let him spring some surprises.</p>\n<p>His first advantage came in the form of a complete map of the debris field, something the incoming bandits wouldn&#8217;t have. As input to his navigation system, he plotted a continual randomized course through the rocks that should make his lumbering miner a harder target.</p>\n<p>Apropos of that, his augmented sensor net showed the bandits entering the debris field, tracking toward his last position. He had sixteen motes spread throughout the field, and the bandits had already passed a half-dozen of them quietly clinging to rocks. With a few quick engine pulses, the motes pushed off into intercept courses and then went to sleep. As tiny as they were, he hoped he could keep them from registering as threats.</p>\n<p>Alan yawned, the bandits closed, and so did his motes. Another ping startled him: a missile launch from the lead bandit. That was odd, because pirates usually made some kind of threat first, demanding his cargo and suchlike. The sensor blip detached from the main group, began streaking toward his position &#8211; and then flared out of existence. Two motes dropped out of his network, having moved to deflect the threat before he&#8217;d had a chance to react. So far, so good &#8211; his code had surprised even him.</p>\n<p>Alan cleared his throat and opened the local comm channel. Jamming would keep him from broadcasting far, but the bandits would hear him.</p>\n<p>&#8220;Attention, unidentified aggressors. This is your only warning. Break off your approach, respond to my hail, and I will regard that missile launch as a mistake.&#8221;</p>\n<p>A few tense seconds passed. He figured the bandits must be wondering what had happened to their missile. His warning would at least sound good in his black box recording.</p>\n<p>News from his drifting motes: He&#8217;d lost most of them to point-defense lasers that had identified them as navigational hazards, but he&#8217;d landed two on the lead ship. He selected some additional motes and sent them on intercepts with the bandits for another try.</p>\n<p>A second missile launch registered. Two motes boosted away from their respective asteroids into the path of the missile. They missed, an over-correction in the software sending them splashing across neighboring rocks. Another pair boosted after the missile, but Alan wasn&#8217;t very happy about their chances.</p>\n<p>&#8220;I&#8217;ll take that as your response,&#8221; he growled. He issued a command, and the motes clinging to the lead bandit began mining.</p>\n<p>For the most part, mining and salvage tools posed little threat as anti-ship weapons. But, as it happened, the bandit&#8217;s hull contained some of the very materials covered by the motes&#8217; design. Given the direct contact with the mass, the little machines had no trouble doing their jobs.</p>\n<p>The lead bandit ship broke up, the hull shredding in a confusion of actinic flares, punctuated by a sharp detonation from the drive core as it failed. Alan also registered the motes and their contributions dropping out of the network &#8211; a worrying sliver of the debris field had gone dark, and everything was getting slower.</p>\n<p>Meanwhile, there was a missile still tracking him, and his pursuing motes just weren&#8217;t going to catch up in time. Worse yet, his ship was too cumbersome to outrun or lose the missile, which was an semi-intelligent mote in its own right.</p>\n<p>Still, his map of the field gave him some options. He tweaked his vector to swing through a narrow gap between two rocks; the missile followed, two seconds behind. A mote clung to each of the rocks, and he detonated them with engine overloads. That had definitely been a warranty violation.</p>\n<p>The force was just enough to send the masses tumbling together &#8211; the gap closed as the missile was half-way though. The detonation blasted the rocks apart and threw a hail of shrapnel against the aft of his ship. He lost a few maneuvering jets, and a slow leak registered in one of his atmosphere tanks. Troubling, but it could have been worse.</p>\n<p>After a beat, he discovered it was worse: He&#8217;d lost some comm lasers, which disrupted his link to the mote network. And, so, he&#8217;d lost track of the remaining bandits.</p>\n<p>Cursing, he called up his last good scan of the field and used dead reckoning to estimate where the bandits would show up next. He crept through the field, trying to keep rocks between him and his guesses. Using his remaining comm lasers, he swept to reconnect with any visible motes.</p>\n<p>As he drifted into a clearing, his sensors lit up with targeting alerts. Apparently, the bandits had changed course. No missile this time: A barrage of heavy projectile fire tore into his hull and holed the cargo bay.</p>\n<p>They&#8217;d missed the cockpit, though, which left him shaken but still breathing. Better yet, one of his comm lasers got line-of-sight on a mote, reestablishing his network connection. As it turned out, the line-of-sight coincided with the bandits themselves &#8211; because his remaining motes had found their way onto their hulls.</p>\n<p>With a raw shout, he issued the command to start mining. In quick succession, the bandits bloomed into the most beautiful fireworks he&#8217;d ever seen. And, with that, his long-range comms came back online. His hyperdrive, though, didn&#8217;t seem worth trying &#8211; either it would implode, or the hull would collapse, or both.</p>\n<p>So, with an impatient eye on his life support reserves, he started negotiating for a rescue contract with a salvage group on one of the inner system stations.</p>\n"}