{"comments_archived":true,"date":"2005-06-25T00:00:00.000Z","layout":"post","title":"Microsoft + RSS: Godzilla tiptoes into Tokyo","wordpress_id":659,"wordpress_slug":"microsoft-rss-godzilla-tiptoes-into-tokyo","wordpress_url":"http://www.decafbad.com/blog/?p=659","url":"/2005/06/25/microsoft-rss-godzilla-tiptoes-into-tokyo/","path":"2005/06/25/microsoft-rss-godzilla-tiptoes-into-tokyo","content":"<p>So, from the sounds of things, <a href=\"http://www.decafbad.com/blog/2004/06/14/info_freako_or_whos_already_past_arguing_about_syndication_formats\">the syndication wars</a> have had another flare-up <a href=\"http://dannyayers.com/archives/2005/06/24/ms-rss/\">after the appearance of Microsoft on the scene</a>.  </p>\n<p>Strange that all the <a href=\"http://msdn.microsoft.com/longhorn/understanding/rss/legalfaq/default.aspx\">Frequently Asked Questions about Simple List Extensions</a> are about legal and licensing issues.  I&#39;d really like some answers to questions such as, well, &quot;What&#39;s this practically good for?&quot;  (<strong>Update</strong>: <em>You know, like this doc about <a href=\"http://msdn.microsoft.com/longhorn/understanding/rss/rsslonghorn/#architecture\">RSS Support in Longhorn</a></em>)</p>\n<p>But, you know, Microsoft probably has whole teams of people constantly scrubbing the tar and feathers off the campus buildings, so I can&#39;t fault them for their enthusiasm to really hammer home the &quot;<a href=\"http://creativecommons.org/weblog/entry/5487\"><strong>LOOK LOOK CREATIVE COMMONS</strong></a>&quot; message.</p>\n<p>And, it&#39;s at least refreshing to see <a href=\"http://www.blueskyonmars.com/2005/06/24/rss-in-longhorn/\">a little less embrace-and-extend than usual for Microsoft</a> in that their extensions at least use namespaces and <em>attempt</em> to fit into RSS.  Though, they could&#39;ve done a lot more toward <a href=\"http://www.tnl.net/blog/entry/Microsoft_Loves_RSS\">reusing prior work</a> in this area.  In the meantime, I&#39;m not entirely sure what this extension is good for and what I&#39;m supposed to do with it in an aggregated set of RSS items.</p>\n<p>So, I guess the thing that Microsoft is hyping and various people are excited about is this:</p>\n<ol>\n<li>Microsoft is finally waking up to RSS.  (<em>Fashionably late--but welcome to the party, guys.</em>)</li>\n<li>Microsoft is not stomping Godzilla-style through the town we&#39;ve been working hard to build.</li>\n</ol>\n<p>I was looking for something genuinely new and clever, but what it really looks like is that something lumbering and usually somewhat destructive is tiptoeing carefully amongst the little people.  The particulars of the extension aren&#39;t all that deft, but the manner in which it&#39;s been delivered unto the world is the real stage show.</p>\n"}