{"comments_archived":true,"date":"2006-02-25T00:00:00.000Z","layout":"post","tags":["asides"],"title":"More on the blogosphere as a tuple space","wordpress_id":904,"wordpress_slug":"more-on-the-blogosphere-as-a-tuple-space","wordpress_url":"http://decafbad.com/blog/2006/02/25/more-on-the-blogosphere-as-a-tuple-space","url":"/2006/02/25/more-on-the-blogosphere-as-a-tuple-space/","path":"2006/02/25/more-on-the-blogosphere-as-a-tuple-space","content":" <p>On introducing people to blogging, <a href=\"http://www.scripting.com/2006/02/24.html#bloggingForNewbies\">Dave wrote</a>:</p>\n     <ul>\n     <li>\n     <span><i>Then someday, when you&#39;re in the shower or lying in bed in the morning and get an idea that you wish you could tell everyone, remember that you have a blog, and go to the computer, and write it up and publish it. That actually feels pretty good, even if you think no one will read it, because you got it off your chest.</i></span>\n     </li>\n     <li>\n     <span><i>Then in a few days Google will probably visit your site and index the post, and then when someone searches for that subject, your page will come up, and maybe you&#39;ll pass that idea on to someone who can use it, or meet someone who agrees, or someone who disagrees. And that&#39;s blogging, and that&#39;s all it is.</i></span>\n     </li>\n     </ul>\n <p>When I&#39;ve <a href=\"http://decafbad.com/blog/index.php?s=tuple\">written about the blogosphere being like a tuple space</a>, this is basically what I mean - only I use nerdier terms so that I can think about the tools and data structures involved.</p>\n\n<div id=\"comments\" class=\"comments archived-comments\">\n            <h3>Archived Comments</h3>\n\n        <ul class=\"comments\">\n\n        <li class=\"comment\" id=\"comment-221085163\">\n            <div class=\"meta\">\n                <div class=\"author\">\n                    <a class=\"avatar image\" rel=\"nofollow\" \n                       href=\"\"><img src=\"http://disqus.com/api/users/avatars/alex_and_r.jpg\"/></a>\n                    <a class=\"avatar name\" rel=\"nofollow\" \n                       href=\"\">alex_and_r</a>\n                </div>\n                <a href=\"#comment-221085163\" class=\"permalink\"><time datetime=\"2006-03-03T06:50:06\">2006-03-03T06:50:06</time></a>\n            </div>\n            <div class=\"content\"><p>I, myself, sometimes feel like blogs are projections of our personalities on  the internet - the global information space. They are like our avatars in another world. And they act there on our behalf, expressing our emotions, providing our ideas, speaking to other avatars, which pass our words to their owners in real world. We all begin to present online. Not just from time to time, when we are &quot;free to chat&quot; in icq, but permanently, cuz blogs are always there and bits of our personality are always (really 24/7) available for other people.</p></div>\n\n<pre><code>    &lt;/li&gt;\n\n    &lt;/ul&gt;\n\n    &lt;/div&gt;\n</code></pre>"}