{"title":"Parsec Patrol Diaries: Construction Time Again","tags":["html5","parsecpatrol","webdev"],"date":"2015-02-09T00:00:00.000Z","url":"/2015/02/09/parsec-patrol-resumes/","path":"2015/02/09/parsec-patrol-resumes","content":"<p>Holy crap. Has it really been a year or so since I last hacked in earnest on\n<a href=\"https://github.com/lmorchard/parsec-patrol\">Parsec Patrol</a>? I&#39;ve been meaning to get back to it, and it&#39;s always felt like\njust last week when I was poking at it.</p>\n<p>Well, a week or so ago, I read <a href=\"https://twitter.com/blakewilliams__\">Blake Williams&#39;</a> &quot;<a href=\"http://robots.thoughtbot.com/replace-[coffeescript][]-with-es6\">Replace <a href=\"http://coffeescript.org/\">CoffeeScript</a>\nwith ES6</a>&quot; and thought, &quot;Hmm, on what project did I last use\n<a href=\"http://coffeescript.org/\">CoffeeScript</a>? Oh yeah: <a href=\"https://github.com/lmorchard/parsec-patrol\">Parsec patrol</a>!&quot; So, I decided to take a swing through\nthe code and see what I was last up to. </p>\n<p>After a good look, I started an empty <a href=\"https://github.com/lmorchard/parsec-patrol/commits/newbranch\">new branch</a> in <a href=\"https://github.com/lmorchard/parsec-patrol\">my\nrepo</a> and started from scratch.</p>\n<p>See, I started <a href=\"https://github.com/lmorchard/parsec-patrol\">Parsec Patrol</a> as an excuse to force myself to learn a bunch of\nnew things I&#39;d been putting off for awhile. Near the top of the list were\n<a href=\"http://yeoman.io/\">Yeoman</a>, <a href=\"http://gruntjs.com/\">Grunt</a>, <a href=\"http://bower.io/\">Bower</a>, <a href=\"http://requirejs.org/\">RequireJS</a>, and <a href=\"http://coffeescript.org/\">CoffeeScript</a>. Those\nwere all cool things, so I figured I&#39;d just stir them all up in a big mess and\nsee what happened.</p>\n<p>The process was fun - these were things that slotted into empty spots in my\nwebdev process, both expected and unexpected. Of course, <a href=\"http://requirejs.org/\">RequireJS</a> was a\nlittle awkward in comparison to modules in <a href=\"http://nodejs.org/\">Node.js</a>.  But hey, modules in\nthe browser! And, I never really quite grokked what was going on in those\ntangly <a href=\"http://gruntjs.com/\">Grunt</a> configuration files and just kind of copypasta&#39;d what others\nwere doing. But hey, build automation for all my weird webdev needs!</p>\n<p>Then, after a nice &amp; relaxing holiday vacation to wrap up 2013, I read &quot;<a href=\"http://www.100percentjs.com/just-like-[grunt][]-[gulp][]-[browserify][]-now/\">And\njust like that Grunt and RequireJS are out, it’s all about Gulp and Browserify\nnow</a>&quot;. </p>\n<p>Well that, along with things that followed, just drained my enthusiasm for\n<a href=\"http://gruntjs.com/\">Grunt</a>, <a href=\"http://bower.io/\">Bower</a>, and <a href=\"http://requirejs.org/\">RequireJS</a> in an hurry. But, it didn&#39;t leave me\nwanting to dive into the next big thing right away. So, I took a step back and\nplayed with other things for a few seasons. <a href=\"https://github.com/lmorchard/brick-select\">Web components</a> and <a href=\"https://github.com/lmorchard/node-firefox\">developer\ntools</a> are kind of fun to hack on. <a href=\"https://www.polymer-project.org/\">Polymer</a> was kind of a crazy rabbit\nhole.</p>\n<p>But, over the past year, <a href=\"http://gulpjs.com/\">Gulp</a> and <a href=\"http://browserify.org/\">Browserify</a> started sneaking into my\nwork despite my fatigue - and they were helping me get things done. <a href=\"http://gulpjs.com/\">Gulp</a>\nmade sense to me: writing glue code to process file streams fit into my head a\nwhole lot better than trying to figure out how to shoehorn my intentions into\ndeclarative-ish config files. And <a href=\"http://browserify.org/\">Browserify</a> gave me some <a href=\"http://nodejs.org/\">Node.js</a>-style\nhappiness on the client-side, pushing most of the awkwardness into the build\nsystem.</p>\n<p>So, now I&#39;ve got <a href=\"http://gulpjs.com/\">Gulp</a>, <a href=\"https://www.npmjs.com/\">NPM</a>, <a href=\"http://browserify.org/\">Browserify</a>, and <a href=\"https://6to5.org/\">6to5</a> as a new pile\nof fun that seems like it might have a little bit of staying power. Of course,\n<a href=\"https://www.youtube.com/watch?v=1IOukA10QeQ\">all this io.js business</a> could throw some monkeywrenches around. But,\nit feels like the patterns I&#39;ve got in play here are more stable than the\nprevious regime. </p>\n<p>Maybe I&#39;ll even recover enough enthusiasm for chasing webdev mayflies by this\nspring to take a deeper dive at things like <a href=\"http://facebook.github.io/react/\">React</a> and <a href=\"https://angularjs.org/\">Angular</a> and\n<a href=\"http://emberjs.com/\">Ember</a>. Then again, maybe I&#39;ll bang together a framework of my own just to\nbe cool.</p>\n<!-- vim: set wrap wm=5 syntax=mkd textwidth=78: -->\n"}