{"comments_archived":true,"date":"2005-08-11T00:00:00.000Z","layout":"post","title":"Quick Thoughts for a Thursday","wordpress_id":674,"wordpress_slug":"quick-thoughts-for-a-thursday","wordpress_url":"http://www.decafbad.com/blog/?p=674","url":"/2005/08/11/quick-thoughts-for-a-thursday/","path":"2005/08/11/quick-thoughts-for-a-thursday","content":"<ul>\n<li><p>I think that one of the greatest compliments I can give to <a href=\"http://www.eastgate.com\">Eastgate</a>, <a href=\"http://www.markbernstein.org\">Mark Bernstein</a>, and <a href=\"http://www.eastgate.com/Tinderbox\">Tinderbox</a> is this:  </p>\n<p>On the few occasions I&#39;ve been inspired to build my own clone of or cousin to Tinderbox, the first tool for which I reach is Tinderbox itself. </p>\n</li>\n<li><p>Another <a href=\"http://www.eastgate.com/Tinderbox\">Tinderbox</a> thought:</p>\n<p>I&#39;ve just realized that I tend to use the Map View in a way analogous to formation of planets in the solar system--at least, as far as I understand it.  I spew various particles of thought onto the screen in a cloud orbiting a central star of an idea, and over time the particles begin to accrete into groupings driven by their own mutual gravities that eventually form categorical planets.  Of course, I&#39;m doing the nudging and taking the role of gravity, but sometimes the structure appears in a spooky Ouija-board-esque manner.</p>\n<p>By <a href=\"http://www.eastgate.com/Tinderbox/sorting.html\">avoiding premature commitment to hierarchy or structure</a>, this allows me to get things out of my head while still only partially encoding ideas in terms of relative position with respect to each other.  This is something that&#39;s really gotten me to consider <a href=\"http://www.eastgate.com/Tinderbox\">Tinderbox</a> as a next generation beyond mere outliners.  It&#39;s just taken me a while to really grok how this works.  It&#39;s a bit like <a href=\"http://www.boxesandarrows.com/archives/card_sorting_a_definitive_guide.php\">Card Sorting</a>.</p>\n</li>\n<li><p><a href=\"http://www.livejournal.com/users/general_jinjur/391464.html?thread=2107176#t2107176\">Here&#39;s a comment I left on a friend&#39;s LiveJournal today</a>:</p>\n</li>\n</ul>\n<blockquote>\n<p>The hiveminded, phosphorescent lichen are conspiring with the mechanized saurans in low earth orbit. They share a common conception of the color blue, at odds with the occluded vision of the mad pachiderms. They plan to bombard the elephants&#39; capital city in India with M&#38;M-shaped tofu blobs--an acceleration of 9.8 meters per second per second from orbit can pack quite a punch. The blobs will first have been electroplated in platinum, using the saurans&#39; wireless electricity. This should help with the stresses of atmospheric reentry.</p>\n</blockquote>\n<blockquote>\n<p>Anyway, I don&#39;t know what&#39;s up with Esther or construction workers. Does she like waffles and eyepatches?</p>\n</blockquote>\n<ul>\n<li>Time for lunch.  Maybe I&#39;ll have more thoughts after food.</li>\n</ul>\n"}